[{"title":"Pocket Weekly Backlog","children":[{"string":"2021-06-06","children":[{"string":"[Inerrancy or Inerrancies?](https://scotmcknight.substack.com/p/inerrancy-or-inerrancies)","children":[{"string":"Written by:: Scot McKnight"},{"string":"Pocket URL : https://app.getpocket.com/read/3346154307"},{"string":"Date Added:: [[June 2nd, 2021]]"},{"string":"Excerpt:: I’m sorry, but I meant for this post to appear Tuesday. It was accidentally sent Saturday but here it is again but with some revisions and additions. When in 1976 Harold Lindsell published The Battle for the Bible the evangelical world was rocked. Split would be a good word."}]},{"string":"[An interview with the people who started Urban Monastics](https://www.postost.net/2021/06/interview-people-who-started-urban-monastics) #[[church/theology]] #[[inoreader]]","children":[{"string":"Written by:: "},{"string":"Pocket URL : https://app.getpocket.com/read/3346520897"},{"string":"Date Added:: [[June 1st, 2021]]"},{"string":"Excerpt:: Here’s another podcast in the “mission in post-Christian Europe” category. It’s an interview with Paul and Jordan Prins and Sheila Wittenberg about their Urban Monastics project. They have some really good things to say about cross-cultural mission in Western Europe, their reasons for starting an “ecumenical monastic community,” and the values and vision that they are seeking to put into practice."}]},{"string":"[How White Christians turned syncretism into an insult](https://www.christiancentury.org/article/critical-essay/how-white-christians-turned-syncretism-insult) #[[church/theology]] #[[inoreader]]","children":[{"string":"Written by:: Ross Kane"},{"string":"Pocket URL : https://app.getpocket.com/read/3347610663"},{"string":"Date Added:: [[June 3rd, 2021]]"},{"string":"Excerpt:: Theology doesn’t have many insults. This is a good thing, because insults diminish another’s humanity and make light of the Creator of that humanity. I take it as a positive sign for the health of Christian theology that it has so few of them."}]}]}]}]
